app/views/teams/show.html.erb


  <% @team.members.each do |member| %>
---
SELECT "members".* FROM "members" WHERE "members"."team_id" = ?  [["team_id", 1]]