app/controllers/members_controller.rb

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "members" ("name", "team_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "aaa"], ["team_id", 1], ["created_at", "2015-11-20 06:14:16.610049"], ["updated_at", "2015-11-20 06:14:16.610049"]]
---
  def create
    @team = Team.find(params[:team_id])
    @member = @team.members.create(member_params)

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", 1]]
SELECT "members".* FROM "members" WHERE "members"."team_id" = ?  [["team_id", 1]]
---
  def randomSeat
    @team = Team.find(params[:team_id])
    @members = @team.members
    @array = Array.new
    @members.each do |member|