app/controllers/teams_controller.rb

INSERT INTO "teams" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "funfun"], ["created_at", "2015-11-20 00:45:03.751418"], ["updated_at", "2015-11-20 00:45:03.751418"]]
---
  def create
    @team = Team.new(team_params)
    if @team.save

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", 40]]
UPDATE "teams" SET "name" = ?, "updated_at" = ? WHERE "teams"."id" = ?  [["name", "{\"na}"], ["updated_at", "2015-11-20 05:26:04.784424"], ["id", 41]]
---
  def update
    @team = Team.find(params[:id])
    if @team.update(team_params)